<a href="https://colab.research.google.com/github/IT-HONGREAT/studying/blob/main/%EB%88%84%EB%9D%BD%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%B2%98%EB%A6%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_intercativity = "all"

import seaborn as sns

df = sns.load_dataset('titanic')
df.tail()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[5 rows x 15 columns]

In [5]:
nan_df = df['deck'].value_counts(dropna = False)
nan_df

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [10]:
df.head().isnull() #NaN 데이터 만 True 처리하고 나머지 Falsse

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False

[5 rows x 15 columns]

In [11]:
df.head().notnull()  #위와 반대

   survived  pclass   sex   age  ...   deck  embark_town  alive  alone
0      True    True  True  True  ...  False         True   True   True
1      True    True  True  True  ...   True         True   True   True
2      True    True  True  True  ...  False         True   True   True
3      True    True  True  True  ...   True         True   True   True
4      True    True  True  True  ...  False         True   True   True

[5 rows x 15 columns]

In [22]:
#위에서 보면 deck 열에 누락데이터가 제일 많았음. 지워야함

ndf = df.dropna(axis = 1, thresh= 445)
ndf.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [24]:
ndf2 = ndf.dropna(subset=['age'],how='any',axis = 0)
print(ndf2.isnull().sum(axis=0))
print('\n')
print(ndf2.notnull().sum(axis=0))

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64


survived       714
pclass         714
sex            714
age            714
sibsp          714
parch          714
fare           714
embarked       712
class          714
who            714
adult_male     714
embark_town    712
alive          714
alone          714
dtype: int64

In [29]:
#누락데이터를 제거하는 것이 아니라 다른 무엇인가로 채우기

#누락데이터 445개 이상인 열 제거

df.dropna(axis=1,thresh=445,inplace=True)

#age열의 누락 데이터를 평균값으로 채우기

age_median = df['age'].median(axis =0)
print(age_median)
df['age'].fillna(age_median, inplace = True)
df.isnull().sum(axis=0)

28.0

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64